# Определяем переменные

user_name = 'Denis Ivashkeev' # Имя пользователя
title = 'Записатся на прием к врачу' # Загаловок заметки
content = 'Взять талон к терапевту, стоматологу, окулисту.' # Описание заметки
status = 'Активна' # Статус заметки
created_date = '30.12.2024' # Дата создания заметки
issue_date =  '30.01.2025' # Дата окончания заметки

# Вывод значений переменных

print("Имя пользователя:", user_name)
print("Заголовок заметки:", title)
print("Описание заметки:", content)
print("Статус заметки:", status)
print("Дата создания заметки:", created_date)
print("Дата истечения заметки:", issue_date)